tylertms/dspic33e-sim/conformance/interrupt_control.c
#include <inttypes.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"
#include "sfr_side_effect_coverage.h"

static const SfrSideEffectCoverage interrupt_control_sfr_side_effect_coverage[] = {
    {0x0052u, 0x3fffu},
    {0x08c2u, 0x2000u},
    {0x08c4u, 0x0070u},
    {0x08c6u, 0x0001u},
};

enum {
    INTCON1 = 0x08c0u,
    INTCON2 = 0x08c2u,
    INTCON3 = 0x08c4u,
    INTCON4 = 0x08c6u,
    INTTREG = 0x08c8u,
    RPINR0 = 0x06a0u,
    RPINR1 = 0x06a2u,
    RPINR2 = 0x06a4u,
    TRISD = 0x0e30u,
    ANSELD = 0x0e3eu,
    DMA_TEST_PAD = 0x0906u,
    MAIN_CLOCK_DIVISOR = 0x0744u,
    TIMER2_COUNTER = 0x0106u,
    TIMER2_PERIOD = 0x010cu,
    TIMER2_CONTROL = 0x0110u,
    COMPARATOR1_CONTROL = 0x0a84u,
    OUTPUT_COMPARE16_CONTROL1 = 0x0996u,
    OUTPUT_COMPARE16_CONTROL2 = 0x0998u,
    OUTPUT_COMPARE16_SECONDARY = 0x099au,
    OUTPUT_COMPARE16_PRIMARY = 0x099cu,
    OUTPUT_COMPARE_TRIGGER = 0x0080u,
    OUTPUT_COMPARE_TRIGGER_STATUS = 0x0040u,
    OUTPUT_COMPARE_FP = 0x1c00u,
    OUTPUT_COMPARE_EDGE_PWM = 6u,
    OPCODE_MOV_W0_INTCON2 = 0x884610u,
    OPCODE_MOV_W0_INTCON3 = 0x884620u,
    OPCODE_RESET = 0xfe0000u,
    OPCODE_RETFIE = 0x064000u
};

static const uint8_t external_interrupt_irqs[DSPIC33_EXTERNAL_INTERRUPT_COUNT] = {
    0u, 20u, 29u, 53u, 54u};
static const uint16_t external_interrupt_pins[DSPIC33_EXTERNAL_INTERRUPT_COUNT] = {
    0x0001u, 0x0002u, 0x0004u, 0x0008u, 0x0010u};

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} InterruptControlConformance;

static void expect(InterruptControlConformance* state, bool condition,
                   const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[interrupt-control-failed] %s\n", name);
    }
}

static Dspic33PendingSoftTrap* pending_trap(Dspic33* cpu, uint16_t trap) {
    size_t index;
    for (index = 0u; index < 4u; index++) {
        if (cpu->pending_soft_traps[index].active &&
            cpu->pending_soft_traps[index].trap == trap) {
            return &cpu->pending_soft_traps[index];
        }
    }
    return NULL;
}

static bool interrupt_flag(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t irq) {
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    uint16_t mask = (uint16_t)(1u << (irq % 16u));
    dspic33_write_word(cpu, address,
                       (uint16_t)(dspic33_read_word(cpu, address) & ~mask));
}

static void clear_external_interrupts(Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_EXTERNAL_INTERRUPT_COUNT; channel++) {
        clear_interrupt(cpu, external_interrupt_irqs[channel]);
    }
}

static uint8_t external_interrupt_flags(Dspic33* cpu) {
    uint8_t channel;
    uint8_t flags = 0u;
    for (channel = 0u; channel < DSPIC33_EXTERNAL_INTERRUPT_COUNT; channel++) {
        if (interrupt_flag(cpu, external_interrupt_irqs[channel])) {
            flags |= (uint8_t)(1u << channel);
        }
    }
    return flags;
}

static void prepare_external_interrupts(Dspic33* cpu, uint16_t levels,
                                        uint16_t polarity) {
    dspic33_gpio_drive(cpu, 3u, levels, 0x003fu);
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, ANSELD, 0u);
    dspic33_write_word(cpu, TRISD, UINT16_MAX);
    dspic33_write_word(cpu, RPINR0, 65u << 8u);
    dspic33_write_word(cpu, RPINR1, (uint16_t)(66u | (67u << 8u)));
    dspic33_write_word(cpu, RPINR2, 68u);
    dspic33_write_word(cpu, INTCON2, (uint16_t)(0x8000u | polarity));
    clear_external_interrupts(cpu);
}

static void enable_interrupt(Dspic33* cpu, uint8_t irq, uint8_t priority,
                             uint32_t vector) {
    uint16_t enable = (uint16_t)(0x0820u + (irq / 16u) * 2u);
    uint16_t priority_address = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t enable_mask = (uint16_t)(1u << (irq % 16u));
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(cpu, enable,
                       (uint16_t)(dspic33_read_word(cpu, enable) | enable_mask));
    dspic33_write_word(cpu, priority_address,
                       (uint16_t)((dspic33_read_word(cpu, priority_address) &
                                   ~(uint16_t)(7u << shift)) |
                                  (uint16_t)(priority << shift)));
    dspic33_load_program_word(cpu, (uint32_t)(0x0014u + irq * 2u), vector);
    dspic33_load_program_word(cpu, vector, 0u);
}

static void access_cases(InterruptControlConformance* state, Dspic33* cpu) {
    dspic33_reset(cpu, 0u);
    expect(state, dspic33_read_word(cpu, INTCON1) == 0u, "INTCON1 POR state");
    expect(state, dspic33_read_word(cpu, INTCON2) == 0x8000u, "INTCON2 POR state");
    expect(state, dspic33_read_word(cpu, INTCON3) == 0u, "INTCON3 POR state");
    expect(state, dspic33_read_word(cpu, INTCON4) == 0u, "INTCON4 POR state");
    expect(state, dspic33_read_word(cpu, INTTREG) == 0u, "INTTREG POR state");

    dspic33_write_word(cpu, INTCON1, 0xffffu);
    expect(state, dspic33_read_word(cpu, INTCON1) == 0xfffeu,
           "INTCON1 implements every status bit except bit zero");
    expect(state, pending_trap(cpu, 4u) == NULL,
           "software MATHERR status does not create a trap source");
    dspic33_write_word(cpu, INTCON1, 0u);
    expect(state, dspic33_read_word(cpu, INTCON1) == 0u,
           "software clears writable INTCON1 status");

    dspic33_device_latch_math_error(cpu, 0x0040u);
    expect(state,
           dspic33_read_word(cpu, INTCON1) == 0x0050u && pending_trap(cpu, 4u) != NULL,
           "hardware math source latches status and schedules trap");
    dspic33_write_word(cpu, INTCON1, 0x0040u);
    expect(state,
           dspic33_read_word(cpu, INTCON1) == 0x0040u && pending_trap(cpu, 4u) == NULL,
           "software MATHERR clear cancels hardware trap source");

