tylertms/dspic33e-sim/conformance/interrupt_control.c
static void lifecycle_cases(InterruptControlConformance* state, Dspic33* source,
                            Dspic33* copy) {
    dspic33_reset(source, 0u);
    dspic33_reset(copy, 0u);
    dspic33_write_word(source, INTCON1, 0x7800u);
    dspic33_device_latch_interrupt(source, 2u, 13u);
    expect(state, dspic33_copy(copy, source), "copy preserves interrupt controls");
    expect(state,
           dspic33_read_word(copy, INTCON1) == 0x7800u &&
               dspic33_read_word(copy, INTTREG) == 0x0d02u,
           "copy preserves interrupt status and dynamic latch");
    dspic33_write_word(source, INTCON1, 0u);
    expect(state, dspic33_read_word(copy, INTCON1) == 0x7800u,
           "copied interrupt status is independent");
    dspic33_reset(source, 0u);
    expect(state,
           dspic33_read_word(source, INTCON1) == 0u &&
               dspic33_read_word(source, INTCON2) == 0x8000u &&
               dspic33_read_word(source, INTCON3) == 0u &&
               dspic33_read_word(source, INTCON4) == 0u &&
               dspic33_read_word(source, INTTREG) == 0u,
           "POR restores interrupt-control state");
}

int main(void) {
    Dspic33 source;
    Dspic33 copy;
    InterruptControlConformance state = {0u, 0u, 0u};
    if (!dspic33_initialize(&source) || !dspic33_initialize(&copy)) {
        fprintf(stderr, "failed to initialize simulator\n");
        return 2;
    }
    access_cases(&state, &source);
    generic_hard_cases(&state, &source);
    generic_soft_cases(&state, &source);
    external_interrupt_edge_cases(&state, &source);
    external_interrupt_selection_cases(&state, &source);
    external_interrupt_interaction_cases(&state, &source);
    external_interrupt_wake_lifecycle_cases(&state, &source, &copy);
    interrupt_entry_latency_cases(&state, &source);
    lifecycle_cases(&state, &source, &copy);
    expect(&state, state.cases == 111u, "interrupt-control assertion accounting");
    report_sfr_side_effect_coverage(
        "interrupt-control", interrupt_control_sfr_side_effect_coverage,
        SFR_SIDE_EFFECT_COVERAGE_COUNT(interrupt_control_sfr_side_effect_coverage),
        state.failed == 0u);
    printf("[interrupt-control-summary] cases=%" PRIu32 " passed=%" PRIu32
           " failed=%" PRIu32 "\n",
           state.cases, state.passed, state.failed);
    dspic33_destroy(&copy);
    dspic33_destroy(&source);
    return state.failed == 0u ? 0 : 1;
}
